/**
 * Created by KimKyungHo on 2024-02-05(005)
 */
public class Main {

    /*
    1. 4명의 Student 모델을 students 배열에 추가하세요.
    - 하나의 Student = id(학번), name(이름), score(점수)에 모두 다른 임의의 값을 넣어줍니다.
    - People, Student 모델을 완성해야 합니다. (extends, constructor, getter, setter)
     */


    public static void main(String[] args) {

        /*
        2. 4명의 점수를 확인하여 grade 값을 채워줍니다.
        >= 90 : A
        >= 80 : B
        >= 70 : C
        >= 60 : D
        그 외 : F
         */


        /*
        3. 4명의 데이터를 출력합니다.
         */


        /*
        4. 점수가 가장 낮은 학생의 학번과 이름을 출력합니다.
         */


        /*
        5. 전체 학생의 평균 점수를 출력하는 메서드를 생성하고 호출하여 출력합니다.
         */


        /*
        6. 점수가 70점 이상인 학생들만 담은 배열을 리턴하는 메서드를 생성하고 호출하여 모든 정보를 출력합니다.
         */


        /*
        7. 전학생 한 명을 추가한 후 점수를 내림차순으로 정렬해서 이름과 점수만 출력합니다.
         */


        /*
        8. 전학생이 추가된 상태일 때 5.번에서 호출한 메서드를 동일하게 사용했을 때 변경된 내용이 출력될 수 있도록 합니다. (매개변수 변경 가능)
         */

    }

}
